; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-1-272)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p3-0 - location
	p3-1 - location
	p2-1 - location
	p0-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s3)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s1)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 32)
	(= (time-to-walk p3-0 s3) 32)
	(= (time-to-walk s0 p3-0) 43)
	(= (time-to-walk p3-0 s0) 43)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 12)
	(= (time-to-walk p3-1 s3) 12)
	(= (time-to-walk s1 p3-1) 42)
	(= (time-to-walk p3-1 s1) 42)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 7)
	(= (time-to-walk p2-1 s2) 7)
	(= (time-to-walk s1 p2-1) 32)
	(= (time-to-walk p2-1 s1) 32)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 15)
	(= (time-to-walk p0-1 s0) 15)
	(= (time-to-walk s1 p0-1) 21)
	(= (time-to-walk p0-1 s1) 21)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 18)
	(= (time-to-drive s2 s1) 18)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 42)
	(= (time-to-drive s3 s1) 42)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 32)
	(= (time-to-drive s0 s3) 32)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 41)
	(= (time-to-drive s2 s3) 41)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 28)
	(= (time-to-drive s2 s0) 28)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at truck2 s3)
	(at truck4 s1)
	(at package1 s1)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver2 s1 p2-1)
   deleted: (at driver2 s1)
   added: (at driver2 p2-1)
   goals met: 3 of 4
2. (walk driver2 p2-1 s2)
   deleted: (at driver2 p2-1)
   added: (at driver2 s2)
   goals met: 3 of 4
3. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 3 of 4
4. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 0 to 410
   goals met: 4 of 4
